dontsovcmc/waterius/ESP8266/src/config.cpp

#include "config.h"
#include "Logging.h"
#include "core/readings.h"
#include "core/wakeup.h"

#include <ESP8266WiFi.h>
#include <IPAddress.h>
#include <EEPROM.h>
#include "utils.h"
#include "porting.h"
#include "sync_time.h"
#include "wifi_helpers.h"
#include "flash_hal.h"


// Конвертируем значение переменных компиляции в строку
#define VALUE_TO_STRING(x) #x
#define VALUE(x) VALUE_TO_STRING(x)
#define VAR_NAME_VALUE(var) #var "=" VALUE(var)

// Сохраняем конфигурацию в EEPROM
void store_config(const Settings &sett)
{
    uint16_t crc = get_checksum(sett);
    EEPROM.begin(sizeof(sett) + sizeof(crc));
    EEPROM.put(0, sett);
    EEPROM.put(sizeof(sett), crc);

    if (!EEPROM.commit())
    {
        LOG_ERROR(F("Config stored FAILED"));
    }
    else
    {
        LOG_INFO(F("Config stored OK crc=") << crc);
    }
    EEPROM.end();
}

// Инициализация параметров по умолчанию
bool init_config(Settings &sett)
{   
    sett.version = CURRENT_VERSION;
    LOG_INFO(F("cfg version=") << sett.version);

    sett.wakeup_per_min = DEFAULT_WAKEUP_PERIOD_MIN;
    sett.period_min_tuned = DEFAULT_WAKEUP_PERIOD_MIN;
    sett.mode = SETUP_MODE;
    sett.mqtt_auto_discovery = (uint8_t)MQTT_AUTO_DISCOVERY;
    
    sett.counter0_name = CounterName::WATER_HOT;
    sett.counter1_name = CounterName::WATER_COLD;

    sett.factor0 = AS_COLD_CHANNEL;
    sett.factor1 = AUTO_IMPULSE_FACTOR;

    sett.waterius_on = (uint8_t)true;
    sett.http_on = (uint8_t)false;
    sett.mqtt_on = (uint8_t)false;
    sett.dhcp_off = (uint8_t)false;
    sett.mqtt_retain = (uint8_t)true;

    // Не через PROGMEM: ради двух полей смысла нет

    strncpy0(sett.waterius_host, WATERIUS_DEFAULT_DOMAIN, sizeof(WATERIUS_DEFAULT_DOMAIN));

    String default_topic = String(MQTT_DEFAULT_TOPIC_PREFIX) + "/" + String(getChipId()) + "/";
    strncpy0(sett.mqtt_topic, default_topic.c_str(), default_topic.length() + 1);
    
    String discovery_topic(DISCOVERY_TOPIC);
    strncpy0(sett.mqtt_discovery_topic, discovery_topic.c_str(), discovery_topic.length() + 1);

    strncpy0(sett.ntp_server, DEFAULT_NTP_SERVER, sizeof(DEFAULT_NTP_SERVER));

    IPAddress network_gateway;
    network_gateway.fromString(DEFAULT_GATEWAY);
    sett.gateway = network_gateway;
    
    IPAddress network_mask;
    network_mask.fromString(DEFAULT_MASK);
    sett.mask = network_mask;

    // Можно задать константы при компиляции, чтобы Ватериус сразу заработал

#ifdef WATERIUS_HOST
#pragma message(VAR_NAME_VALUE(WATERIUS_HOST))
    String waterius_host = VALUE(WATERIUS_HOST);
    strncpy0(sett.waterius_host, waterius_host.c_str(), WATERIUS_HOST_LEN);
    LOG_INFO("default waterius_host=" << waterius_host);
#endif

#ifdef MQTT_HOST
#pragma message(VAR_NAME_VALUE(MQTT_HOST))
    String mqtt_host = VALUE(MQTT_HOST);
    strncpy0(sett.mqtt_host, mqtt_host.c_str(), HOST_LEN);
    LOG_INFO("default mqtt_host=" << mqtt_host);
#endif

#ifdef MQTT_LOGIN
#pragma message(VAR_NAME_VALUE(MQTT_LOGIN))
    String mqtt_login = VALUE(MQTT_LOGIN);
    strncpy0(sett.mqtt_login, mqtt_login.c_str(), MQTT_LOGIN_LEN);
    LOG_INFO("default mqtt_login=" << mqtt_login);
#endif

#ifdef MQTT_PASSWORD
#pragma message(VAR_NAME_VALUE(MQTT_PASSWORD))
    String mqtt_password = VALUE(MQTT_PASSWORD);
    strncpy0(sett.mqtt_password, mqtt_password.c_str(), MQTT_PASSWORD_LEN);
    LOG_INFO("default mqtt_password=" << mqtt_password);
#endif

#ifdef WATERIUS_EMAIL
#pragma message(VAR_NAME_VALUE(WATERIUS_EMAIL))
    strncpy0(sett.waterius_email, VALUE(WATERIUS_EMAIL), EMAIL_LEN);
    LOG_INFO(F("default waterius email=") << VALUE(WATERIUS_EMAIL));
#endif

    LOG_INFO(F("Generate waterius key"));
    generateSha256Token(sett.waterius_key, WATERIUS_KEY_LEN, sett.waterius_email);
    LOG_INFO(F("waterius key=") << sett.waterius_key);

#ifdef WIFI_SSID
#pragma message(VAR_NAME_VALUE(WIFI_SSID))
#ifdef WIFI_PASS
#pragma message(VAR_NAME_VALUE(WIFI_PASS))
    strncpy0(sett.wifi_ssid, VALUE(WIFI_SSID), WIFI_SSID_LEN);
    strncpy0(sett.wifi_password, VALUE(WIFI_PASS), WIFI_PWD_LEN);
    return true;
#endif
#endif
    return false;
}

/* Загружаем конфигурацию в EEPROM. true - успех. */
bool load_config(Settings &sett)
{
    LOG_INFO(F("Loading Config..."));
    uint16_t crc = 0;
    Settings tmp_sett = {};
    EEPROM.begin(sizeof(tmp_sett) + sizeof(crc)); //  4 до 4096 байт. с адреса 0x7b000.
    EEPROM.get(0, tmp_sett);
    EEPROM.get(sizeof(tmp_sett), crc);
    EEPROM.end();

    uint16_t calculated_crc = get_checksum(tmp_sett);
    if (crc == calculated_crc)
    {
        if (tmp_sett.version != sett.version)
        {
            LOG_INFO(F("ESP has old configuration version=") << tmp_sett.version);
            LOG_INFO(F("Init configuration version=") << sett.version);
            bool ret = init_config(sett);
            
            strncpy0(sett.waterius_key, tmp_sett.waterius_key, WATERIUS_KEY_LEN);
            LOG_INFO(F("Restore waterius_key=") << sett.waterius_key);

            /*
            Период пробуждения переживает смену версии конфига (#350). Иначе
            после обновления прошивки устройство замолкает на сутки: в attiny
            уезжает умолчание 1440 минут вместо настроенных пользователем, и
            выглядит это как зависшее устройство.

            Значение проверяется на разумность: поле лежит глубоко в
            структуре, и в конфиге прошлой версии по этому смещению мог
            оказаться совсем другой байт.
            */
            const uint16_t restored = restore_wakeup_period(tmp_sett.wakeup_per_min,
                                                            sett.wakeup_per_min);
            if (restored != sett.wakeup_per_min)
            {
                sett.wakeup_per_min = restored;
                // Накопленная поправка относилась к прежнему периоду
                reset_period_min_tuned(sett);
            }
            LOG_INFO(F("Restore wakeup min=") << sett.wakeup_per_min);

            store_config(sett);

            return ret;
        }
        else 
        {
            sett = tmp_sett;
            LOG_INFO(F("Configuration CRC ok"));

            // Для безопасной работы с буферами,  в библиотеках может не быть проверок
            sett.waterius_host[HOST_LEN - 1] = 0;
            sett.waterius_key[WATERIUS_KEY_LEN - 1] = 0;
            sett.waterius_email[EMAIL_LEN - 1] = 0;

            sett.http_url[HOST_LEN - 1] = 0;

            sett.mqtt_host[HOST_LEN - 1] = 0;
            sett.mqtt_login[MQTT_LOGIN_LEN - 1] = 0;
            sett.mqtt_password[MQTT_PASSWORD_LEN - 1] = 0;
            sett.mqtt_topic[MQTT_TOPIC_LEN - 1] = 0;
            sett.mqtt_discovery_topic[MQTT_TOPIC_LEN - 1] = 0;

            sett.ntp_server[HOST_LEN - 1] = 0;

            LOG_INFO(F("wakeup min=") << sett.wakeup_per_min);

            LOG_INFO(F("--- Waterius.ru ---- "));
            if (sett.waterius_on) {
                LOG_INFO(F("state=ON"));
            } else {
                LOG_INFO(F("state=OFF"));
            }
            LOG_INFO(F("email=") << sett.waterius_email);
            LOG_INFO(F("host=") << sett.waterius_host << F(" key=") << sett.waterius_key);
            LOG_INFO(F("place=") << sett.place);
            LOG_INFO(F("company=") << sett.company);

            LOG_INFO(F("--- HTTP ---- "));
            if (sett.http_on) {
                LOG_INFO(F("state=ON"));
            } else {
                LOG_INFO(F("state=OFF"));
            }
            LOG_INFO(F("host=") << sett.http_url);

            LOG_INFO(F("--- MQTT ---- "));
            if (sett.mqtt_on) {
                LOG_INFO(F("state=ON"));
            } else {
                LOG_INFO(F("state=OFF"));
            }
            LOG_INFO(F("host=") << sett.mqtt_host << F(" port=") << sett.mqtt_port);
            LOG_INFO(F("login=") << sett.mqtt_login << F(" pass=") << sett.mqtt_password);
            LOG_INFO(F("auto discovery=") << sett.mqtt_auto_discovery);
            LOG_INFO(F("retain=") << sett.mqtt_retain);
            LOG_INFO(F("discovery topic=") << sett.mqtt_discovery_topic);

            LOG_INFO(F("--- Network ---- "));
            if (sett.ip)
            {
                if (sett.dhcp_off) {
                    LOG_INFO(F("DHCP=OFF"));
                } else {
                    LOG_INFO(F("DHCP=ON"));
                }
                LOG_INFO(F("static_ip=") << IPAddress(sett.ip).toString());
                LOG_INFO(F("gateway=") << IPAddress(sett.gateway).toString());
                LOG_INFO(F("mask=") << IPAddress(sett.mask).toString());
            }
            else
            {
                LOG_INFO(F("DHCP is on"));
            }

            LOG_INFO(F("ntp_server=") << sett.ntp_server);
            LOG_INFO(F("ntp_error_counter=") << sett.ntp_error_counter);

            LOG_INFO(F("--- WIFI ---- "));
            LOG_INFO(F("wifi_ssid=") << sett.wifi_ssid);
            LOG_INFO(F("wifi_channel=") << sett.wifi_channel);
            LOG_INFO(F("wifi_phy_mode=") << wifi_phy_mode_title((WiFiPhyMode_t)sett.wifi_phy_mode));
            LOG_INFO(F("wifi_connect_errors=") << sett.wifi_connect_errors);
            LOG_INFO(F("wifi_connect_attempt=") << sett.wifi_connect_attempt);

            LOG_INFO(F("Config succesfully loaded"));
            return true;
        }
    }
    else
    {
        LOG_INFO(F("ESP config CRC failed. Maybe first run. Init configuration."));
        LOG_INFO(F("Saved crc=") << crc << F(" calculated=") << calculated_crc);
        return init_config(sett);
    }
}

/*
Берем начальные показания и кол-во импульсов,
вычисляем текущие показания по новому кол-ву импульсов
*/
void calculate_values(Settings &sett, const AttinyData &data, CalculatedData &cdata)
{
    LOG_INFO(F("Calculating values..."));

    ReadingsStatus status = calc_readings(sett, data, cdata);

    if (status.impulses0_start_reset)
    {
        LOG_ERROR(F("Impulses0 less than start. Reset impulses0_start"));
    }

    LOG_INFO(F("channel0  name=") << sett.counter0_name);
    LOG_INFO(F("impulses0 start=") << sett.impulses0_start << F(" current=") << data.impulses0 << F(" factor=") << sett.factor0);
    LOG_INFO(F("value0    start=") << sett.channel0_start << F(" current=") << cdata.channel0 << F(" delta=") << cdata.delta0);

    if (status.impulses1_start_reset)
    {
        LOG_ERROR(F("Impulses1 less than start. Reset impulses1_start"));
    }

    LOG_INFO(F("channel1  name=") << sett.counter1_name);
    LOG_INFO(F("impulses1 start=") << sett.impulses1_start << F(" current=") << data.impulses1 << F(" factor=") << sett.factor1);
    LOG_INFO(F("value1    start=") << sett.channel1_start << F(" current=") << cdata.channel1 << F(" delta=") << cdata.delta1);
}

/* Сбрасываем скорректированный период после изменения периода пользователем */
void reset_period_min_tuned(Settings &sett)
{
    sett.period_min_tuned = period_after_user_change(sett.wakeup_per_min);
    LOG_INFO(F("RESET: period_min_tuned=") << sett.period_min_tuned);

    // Накопленное измерение относилось к прежнему периоду: и число проспанных
    // периодов, и точка отсчёта времени теперь врут. Начинаем заново, с
    // прогрева, иначе первая поправка приедет только через сутки.
    sett.last_time_sync = 0;
    sett.wakeups_since_sync = 0;
    sett.ntp_sync_count = 0;

    // Поправка измерялась в кривых минутах прежнего периода
    sett.period_min_full = 0;
}

/* Обновляем значения в конфиге */
void update_config(Settings &sett, const AttinyData &data, const CalculatedData &cdata,
                   const bool time_synced, const bool reported)
{
    LOG_INFO(F("Updating config..."));

    /*
    Точку отсчёта прироста двигаем только если данные доехали (#407): Wi-Fi мог
    подняться, а посылка не уйти - сервер недоступен, ответил не 200, ключ не
    тот. Показания это не задевает, они считаются от impulses_start.
    */
    if (reported)
    {
        sett.impulses0_previous = data.impulses0;
        sett.impulses1_previous = data.impulses1;
    }
    else
    {
        LOG_INFO(F("Delta kept: nobody accepted the data"));
    }

    // Значение по умолчанию. Уменьшим с учётом опроса входов.
    if (!sett.period_min_tuned) {
        reset_period_min_tuned(sett);
    }

    // Перешлем время пробуждения на сервер при след. включении
    sett.wake_time = millis();

    // Ручное пробуждение кнопкой задаёт расписание заново, поэтому заказываем
    // целый период с поправкой, а не остаток до прежней цели (#380): иначе в
    // attiny ушло бы значение из прошлого цикла, и нажатие промахнулось бы на
    // часы, если то пробуждение было не по расписанию.
    //
    // Делается до проверки времени: даже без интернета следующий выход на
    // связь должен случиться через период после нажатия.
    if (sett.mode == MANUAL_TRANSMIT_MODE)
    {
        sett.period_min_tuned = period_after_manual_wakeup(sett.period_min_full, sett.wakeup_per_min);
        LOG_INFO(F("Manual wakeup: period_min_tuned=") << sett.period_min_tuned);
    }

    /*
    Сеанс по тревоге (#202) разрезал период сна пополам: attiny после него
    засыпает на целый период заново, и время до следующего планового выхода
    на связь оказывается больше заказанного. Подстройка приняла бы это за
    отставание часов attiny и переложила бы руль. Поэтому сбрасываем точку
    отсчёта: один пропущенный цикл подстройки безобиден, промах расписания
    на часы - нет.

    base_time не трогаем: пользователь по-прежнему ждёт показания в то же
    время суток.
    */
    if (sett.mode == ALARM_MODE)
    {
        sett.last_time_sync = 0;
        sett.wakeups_since_sync = 0;
        LOG_INFO(F("Alarm wakeup: tuning base reset"));
    }

    time_t now = time(nullptr);

    if (!is_valid_time(now)) 
    {
        LOG_ERROR(F("Invalid current time!"));
        return;
    }

    if (!is_valid_time(sett.base_time) || sett.mode == MANUAL_TRANSMIT_MODE || sett.mode == SETUP_MODE) 
    {
        sett.base_time = now;
        LOG_INFO(F("Manual/first wakeup: base_time reset"));
    }

    LOG_INFO(F("Wakeup period, min:") << sett.wakeup_per_min);

    // Корректируем период пробуждения только для автоматического режима и
    // только по времени от NTP: между синхронизациями часы идут по оценке,
    // и сравнивать с ней заказанный период бессмысленно.
    if (sett.mode == TRANSMIT_MODE && time_synced && is_valid_time(sett.last_time_sync)
        && sett.wakeups_since_sync > 0)
    {    
        WakeupTune tune = tune_wakeup(now, sett.base_time, sett.last_time_sync, sett.wakeup_per_min,
                                      sett.period_min_tuned, sett.wakeups_since_sync,
                                      sett.period_min_full);
        LOG_INFO(F("Tune: elapsed_min=") << tune.slept_min 
                 << ", wakeups=" << sett.wakeups_since_sync
                 << ", new_period_min_tuned=" << tune.period_min_tuned);
        sett.period_min_tuned = tune.period_min_tuned;
        sett.period_min_full = tune.period_min_full;
    }

    // Отсчёт до следующей синхронизации начинается заново
    if (time_synced)
    {
        sett.last_time_sync = now;
        sett.wakeups_since_sync = 0;
    }

    sett.last_send = now;
}

void factory_reset(Settings &sett)
{
    //Запоминаем уникальный токен, чтобы потом восстановить
    LOG_INFO(F("Save waterius_key=") << sett.waterius_key);
    String waterius_key = sett.waterius_key;

    ESP.eraseConfig();
    delay(100);
    LOG_INFO(F("EEPROM erased"));

    // The flash cache maps the physical flash into the address space at offset  \ FS_PHYS_ADDR - ?
    ESP.flashEraseSector(((EEPROM_start - 0x40200000) / SPI_FLASH_SEC_SIZE));
    LOG_INFO(F("0x40200000 erased"));

    delay(500);

    init_config(sett);
    strncpy0(sett.waterius_key, waterius_key.c_str(), WATERIUS_KEY_LEN);
    LOG_INFO(F("Restore waterius_key=") << sett.waterius_key);
    store_config(sett);

    delay(500);

    ESP.reset();
}